Results_Report/62054d0f-ea1b-465d-82e1-5721421975ae-attachment.html

<p><b>[TRACE]</b>&nbsp;Arguments: [ 'http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso' | headers={'Content-Type': 'text/xml; charset=utf-8'} | data='<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ListOfContinentsByName xmlns="http://www.oorsprong.org/websamples.countryinfo"></ListOfContinentsByName></soap:Body></soap:Envelope>' ]</p><p><b>[DEBUG]</b>&nbsp;Starting new HTTP connection (1): webservices.oorsprong.org:80</p><p><b>[DEBUG]</b>&nbsp;http://webservices.oorsprong.org:80 "POST /websamples.countryinfo/CountryInfoService.wso HTTP/1.1" 200 466</p><p><b>[INFO]</b>&nbsp;POST Request : url=http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso <br> path_url=/websamples.countryinfo/CountryInfoService.wso <br> headers={'User-Agent': 'python-requests/2.28.1', 'Accept-Encoding': 'gzip, deflate', 'Accept': '*/*', 'Connection': 'keep-alive', 'Content-Type': 'text/xml; charset=utf-8', 'Content-Length': '252'} <br> body=<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ListOfContinentsByName xmlns="http://www.oorsprong.org/websamples.countryinfo"></ListOfContinentsByName></soap:Body></soap:Envelope> <br> </p><p><b>[INFO]</b>&nbsp;POST Response : url=http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso <br> status=200, reason=OK <br> headers={'Cache-Control': 'private, max-age=0', 'Content-Type': 'text/xml; charset=utf-8', 'Content-Encoding': 'gzip', 'Vary': 'Accept-Encoding', 'Server': 'Microsoft-IIS/8.5', 'Web-Service': 'DataFlex 19.1', 'Date': 'Fri, 23 Sep 2022 06:18:58 GMT', 'Content-Length': '466'} <br> body=<?xml version="1.0" encoding="utf-8"?><br><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><br>  <soap:Body><br>    <m:ListOfContinentsByNameResponse xmlns:m="http://www.oorsprong.org/websamples.countryinfo"><br>      <m:ListOfContinentsByNameResult><br>        <m:tContinent><br>          <m:sCode>AF</m:sCode><br>          <m:sName>Africa</m:sName><br>        </m:tContinent><br>        <m:tContinent><br>          <m:sCode>AN</m:sCode><br>          <m:sName>Antarctica</m:sName><br>        </m:tContinent><br>        <m:tContinent><br>          <m:sCode>AS</m:sCode><br>          <m:sName>Asia</m:sName><br>        </m:tContinent><br>        <m:tContinent><br>          <m:sCode>EU</m:sCode><br>          <m:sName>Europe</m:sName><br>        </m:tContinent><br>        <m:tContinent><br>          <m:sCode>OC</m:sCode><br>          <m:sName>Ocenania</m:sName><br>        </m:tContinent><br>        <m:tContinent><br>          <m:sCode>AM</m:sCode><br>          <m:sName>The Americas</m:sName><br>        </m:tContinent><br>      </m:ListOfContinentsByNameResult><br>    </m:ListOfContinentsByNameResponse><br>  </soap:Body><br></soap:Envelope> <br> </p><p><b>[TRACE]</b>&nbsp;Return: <Response [200]></p><p><b>[INFO]</b>&nbsp;${response} = <Response [200]></p>